

#Область ПрограммныйИнтерфейс


// Расчет суммы.
// 
// Параметры:
//  СтрокаДокум - см. СтруРасчета
Процедура РасчетСуммы(СтрокаДокум) Экспорт
	СтрокаДокум.Сумма = СтрокаДокум.Количество*СтрокаДокум.Цена;
КонецПроцедуры

// Стру расчета.
// 
// Возвращаемое значение:
//  Структура - Стру расчета:
// * Количество - Число 
// * Цена - Число 
// * Сумма - Число
Функция СтруРасчета() Экспорт
	Стру = Новый Структура;
	Стру.Вставить("Количество", 0);
	Стру.Вставить("Цена", 0);
	Стру.Вставить("Сумма", 0);
	
	Возврат Стру;
КонецФункции


#КонецОбласти